[{"instructions":"Stem artichokes even with their bases and remove and discard any hard outer leaves. In a large saucepan of boiling salted water blanch the artichokes for 6 minutes, or until just tender. Drain the artichokes and refresh under cold water. gently spread the leaves of the artichokes outward. Flatten with the side of a knife, being careful not to crack them, and pat dry. Dredge in flour and coat with eggs, letting excess drip off. Coat with bread crumbs. In deep fryer or heavy saucepan heat oil to 375 F. and fry artichokes, a few at a time, for 3 minutes, or until golden. Transfer to paper towels to drain.","ingredients":["8 (2 oz) baby artichokes, or two large artichokes, quartered","flour for dredging","2 large eggs, beaten lightly","3 cups fresh bread crumbs","Combination olive oil and vegetable oil for deep frying"],"title":"Deep-Fried Baby Artichokes","picture_link":null},{"instructions":"Preheat the oven to 350 degrees F.\nPour the milk into a bowl and soak the bread in the milk for 10 minutes. Put the lamb in a very large bowl. Squeeze the bread (reserve the milk) and then add the soaked bread to the lamb, along with the onion, raisins, almonds, lemon juice, curry powder, and turmeric. Season with salt and pepper.\nMelt the butter and oil in a large frying pan over high heat. Add the meat mixture and brown it lightly, 5 to 7 minutes. Transfer the mixture to a large casserole. Beat the eggs and reserved milk in a bowl and pour over the meat. Garnish with the bay leaves. Bake until the casserole is set, about 1 hour.\nThis recipe was provided by professional chefs and has been scaled down from a bulk recipe provided by a restaurant. The Food Network Kitchens chefs have not tested this recipe, in the proportions indicated, and therefore, we cannot make any representation as to the results.","ingredients":["4 cups milk","2 slices white bread","5 pounds lamb shoulder, cut into small cubes","1 large onion, finely chopped","1\/2 cup raisins","1\/2 cup slivered almonds","4 to 5 tablespoons fresh lemon juice","2 teaspoons curry powder","1 teaspoon ground turmeric","Salt and freshly ground pepper","2 tablespoons butter","2 tablespoons canola oil","3 eggs","2 bay leaves"],"title":"Lamb and Pumpkin Bobotie","picture_link":null},{"instructions":"Preheat oven to 350 degrees F.\nChop garlic in a food processor. Add all other ingredients excluding bread and cheese. Slice bread in 3\/4-inch slices, not all the way through, leave bottom crust connected.\nSpread each side with butter spread. Place a piece of mozzarella between each slice. Brush top and side of bread with butter spread. Wrap in foil. Bake for 25 to 30 minutes, or until cheese is melted throughout. Open foil, and brown under broiler","ingredients":["2 to 3 cloves garlic","1 cup butter, room temperature","1 1\/4 tablespoons dry basil","2 tablespoons capers","1 loaf crusty Italian bread","1 package sliced mozzarella"],"title":"Spudini Bread","picture_link":null},{"instructions":"Watch how to make this recipe.\nPreheat oven to 400 degrees F.\nCut 4 \"walls\" of puff pastry by cutting approximately 1-inch wide strips along each side of a sheet of puff pastry. Set \"walls\" aside. Poke the remaining \"floor\" of puff pastry with a fork to provide an escape for steam.\nLightly apply the egg wash just inside the cut edges of the \"floor\". Stack \"wall\" pieces on top of \"floor\" piece placing the cut edge of the \"walls\" on the outside edge. Dab ends of \"walls\" with egg wash and fold long pieces over to form a square.\nCut a 7 by 7-inch square out of the second sheet of puff pastry. Fold it in half and cut vents for steam along the fold.\nShake bread or cake crumbs on drained cherries and let sit for 10 minutes. Spoon cherry mixture onto pastry \"floor\", using more than you may think necessary to compensate for the pastry puffing. Apply egg wash on \"walls\" avoiding the very edge.\nLay vented \"top\" piece on top. Brush with egg wash.\nBake in oven for 30 minutes. Reduce temperature to 350 degrees F and bake for another 30 minutes.","ingredients":["2 sheets puff pastry, thawed","1 egg beaten with 2 tablespoons water","1 can pie cherries, drained","1\/2 cup bread or cake crumbs"],"title":"Stacked Puff Pastry with Cherries","picture_link":"hFG2vxFSCL5XtM5SxABNKb5OQF5CqXm"},{"instructions":"Watch how to make this recipe.\nFor the meatballs: In a large bowl, combine the breadcrumbs, Parmesan, basil, parsley, milk, tomato paste, garlic, salt, pepper, egg, garlic and onions. Using a wooden spoon, stir to blend. Add the ground turkey and sausage meat. Using fingers, gently mix all the ingredients until thoroughly combined. Using a tablespoon measure, form the meat mixture into 1 to 1 1\/4-inch balls (about 36 meatballs).\nIn a large nonstick skillet, heat the olive oil over medium-high heat. Working in batches, add the meatballs and cook, turning occasionally, until well browned on all sides and cooked through, 10 to 12 minutes. Drain on paper towels.\nFor the sauce: In a food processor or blender, blend together the raspberries, ketchup, jam, sugar, vinegar, Worcestershire sauce, paprika, salt, pepper and lemon zest until smooth. Pour the sauce into a heavy medium saucepan. Bring to a simmer over medium heat. Cook until slightly thickened, 6 to 7 minutes. Remove the pan from the heat and cool for 10 minutes. Pour into a small serving bowl.\nThread 1 meatball, 1 mango cube and 1 piece of radicchio leaf onto each skewer. Arrange the meatballs on a platter and serve the barbecue sauce alongside for dipping.","ingredients":["Meatballs:","1\/2 cup plain breadcrumbs","1\/4 cup finely grated Parmesan","2 tablespoons chopped fresh basil","2 tablespoons chopped fresh Italian parsley","2 tablespoons whole milk","1 1\/2 teaspoons tomato paste","1\/2 teaspoon kosher salt","1\/4 teaspoon freshly ground black pepper","1 large egg, at room temperature","1 clove garlic, minced","1\/2 small onion, finely chopped","8 ounces ground dark turkey meat","8 ounces spicy Italian turkey sausage links, casings removed","3 tablespoons extra-virgin olive oil","Sauce:","2 cups frozen unsweetened raspberries, thawed","3\/4 cup ketchup","3 tablespoons packed golden brown sugar","3 tablespoons balsamic vinegar","1 tablespoon Worcestershire sauce","1 teaspoon smoked paprika","1\/4 teaspoon kosher salt","2\/3 cup seedless raspberry jam","1\/4 teaspoon freshly ground black","Zest of 1 small lemon","2 to 3 large mangoes, peeled, pitted and cut into thirty six 3\/4-inch cubes","Thirty six 1-inch pieces torn radicchio leaves","Special equipment: thirty six 4- to 5-inch-long bamboo skewers"],"title":"Mini Meatballs with Raspberry-Balsamic Barbecue Sauce","picture_link":"U8gBbMbvGGRYdVsT0nP1seEOg5u\/LrG"},{"instructions":"Heat a large heavy stockpot and to it add the olive oil. Add the fish bones and cook them over low heat, covered, until any flesh on them flakes from the bones. Add the vegetables and any shells from the shrimp, cover and cook over low heat until the vegetables sweat, about 10 minutes.\nDeglaze the pot with the wine, scraping up any particles sticking to the bottom of the pan. Stir in the saffron, thyme, and basil.\nAdd the fish stock or water, and let the mixture gently boil for 1 hour. Then puree it in a food processor or pass it through a food mill. Pass the puree through a medium strainer into a clean stockpot. Stir in the Pernod. Season the base, to taste, with salt, pepper and cayenne. The soup should have a full-bodied flavor: If it seems weak, reduce it over low heat to concentrate the flavor.\nPreheat the oven to 350 degrees F.\nSkim any fish oil from the top of the soup and reserve it to stir into the rouille.\nToast the croutons in the oven until golden, and then brush with rouille.\nBring the soup to a boil. Add the shellfish and\/or uncooked fish fillets to the soup, 1 variety at a time. Cook each until done; then remove from the soup and keep warm. (The lobsters will take about 10 minutes and their shells will be bright red when done; medium shrimp will take 3 or 4 minutes to cook; fish fillets from 1 to 7 minutes, depending on their thickness (they should remain slightly underdone); and the mussels and clams only cook for 3 to 5 minutes, until their shells open).\nPresentation: Place 1 crouton in the bottom of each large, shallow, heated soup plates. Then arrange the fish and\/or shellfish around each crouton. Ladle the hot soup over all. Serve immediately. Pass additional rouille in a separate serving bowl.\nClean the fish bones under cold running water, removing the gills from the head and any traces of blood on the frames.\nIn a large saucepan, heat the oil. In it sweat the fish bones and vegetables over low heat, covered, for 10 minutes, stirring once or twice to prevent them from browning.\nDeglaze the pan with the wine, and then add enough water to cover the bones and vegetables by 2 inches. Add the bouquet garni and bring the liquid to a boil. Skim the froth from the surface, reduce the heat, and simmer the stock for 20 to 25 minutes.\nStrain the stock into a clean saucepan. Bring it to a boil and reduce it over medium heat to 1 quart.\nNote: Fish stock will keep in the refrigerator for 2 to 3 days or frozen for 2 to 3 weeks. After that time the flavor begins to fade.\nYield: 1 quart\nPrep Time: 20 minutes\nCook Time: 35 minutes\nIn a bowl, whisk together the egg yolks, garlic, mustard, and chili flakes. Whisk in the oil in a very slow steady stream until the sauce begins to emulsify. Add the remaining oil in a thin stream until all of it is incorporated. Add the saffron. Thin the sauce with the stock and season, to taste, with lemon juice, salt, and pepper.\nYield: 1 1\/2 cups\nPrep Time: 10 minutes","ingredients":["1\/4 cup extra-virgin olive oil","3 pounds fish bones, such as red snapper, sea bass, or halibut","2 medium onions, sliced","2 carrots, peeled and sliced","10 cloves fresh garlic, peeled","2 branches fennel, sliced","10 ripe tomatoes, sliced","1 stalk celery, sliced","1 large potato, peeled and sliced","2 cups dry white wine","Large pinch saffron threads","2 to 3 sprigs fresh thyme","1\/2 bunch fresh basil, chopped","Light fish stock, recipe follows, or water to cover (about 3 cups)","2 tablespoons Pernod","Salt","Freshly ground pepper","Cayenne pepper","12 (1\/2-inch thick) slices French bread (1 per person plus extras)","Rouille, recipe follows","3 small lobsters, and\/or 1 pound medium shrimp, shelled and deveined (shells reserved) or fish fillets, or 36 to 48 mussels or clams (enough for 6 to 8 people)","2 pounds fish skeletons, cut into pieces*","2 tablespoons vegetable or other flavorless oil","1 small carrot, peeled and sliced","1\/2 onion, sliced","1 small stalk celery, sliced","2 cups dry white wine","1 bouquet garni (sprigs of parsley and thyme, peppercorns, and a bay leaf tied in cheesecloth)","1 quart water, approximately","2 egg yolks*","3 to 4 cloves garlic, finely minced","1 tablespoon Dijon mustard","1\/4 teaspoon dried red chili flakes","1 cup olive or almond oil","1\/4 teaspoon saffron","3 to 4 tablespoons fish stock","Lemon juice","Salt","Freshly ground pepper"],"title":"Fish Soup","picture_link":null},{"instructions":"In a large bowl, whisk together the flour, baking powder, baking soda and salt. Set aside.\nIn the bowl of a stand mixer fitted with the paddle attachment, beat the cold butter on medium speed, about 1 minute. Add the brown sugar and granulated sugar and mix until incorporated. Add the eggs and vanilla. Mix on medium-low speed until the mixture looks separated. Turn off the machine and add the dry ingredients. Mix on low speed just until the dough comes together. Turn off the machine and fold in the chocolate chips by hand using a rubber spatula.\nDrop the dough onto a parchment-lined sheet tray in 1-cup mounds. Place the tray in the freezer and freeze for 1 hour.\nPreheat the oven to 375 degrees F.\nBake straight from the freezer until still slightly under baked in the middle but golden brown around the edges and beginning to brown on top, 20 minutes.\nCool the cookies on the tray for 5 minutes before cooling completely on a wire rack.","ingredients":["3 cups bread flour","1 teaspoon baking powder","1\/2 teaspoon baking soda","1\/2 teaspoon kosher salt","1 cup unsalted butter, chilled and cubed","1 cup light brown sugar","1 cup granulated sugar","2 eggs, chilled","2 teaspoons pure vanilla extract","1 cup bittersweet chocolate chips","1\/2 cup semisweet chocolate chips"],"title":"Sin City Cookies","picture_link":"bYUb4skBOmACcjrgyCbF6j1cj8ckPra"},{"instructions":"In a large bowl, mix together the chicken, panko, egg, green onions, chopped cilantro, garlic, chili sauce, and salt. With oiled hands, form mixture into 4 patties. In a small bowl, mix together the teriyaki glaze and honey.\nHeat oil in a large non-stick frying pan over medium-high heat. Add chicken patties and cook on both sides, brushing each side with the teriyaki-honey mixture, about 10 minutes, or until fully cooked through. Place burgers on toasted buns and top with lettuce, cucumber, and Ginger Mayonnaise. Garnish with cilantro sprigs and cucumber slices.\nIn a small bowl, mix together all ingredients. Refrigerate until ready to use.","ingredients":["1 1\/4 pounds ground chicken","2\/3 cup panko bread crumbs","1 egg, lightly beaten","2 green onions, thinly sliced","3 tablespoons chopped cilantro leaves, plus extra for garnish","1 clove garlic, minced","1 teaspoon Asian hot chili sauce","1 teaspoon salt","1\/2 cup bottled teriyaki glaze","4 teaspoons honey","1 tablespoon vegetable oil, plus extra for hands","4 sesame buns, split and toasted","4 leaves red lettuce","1 cucumber, peeled, seeded, halved, and thinly sliced lengthwise","Ginger Mayonnaise, recipe follows","1\/2 cup mayonnaise","2 teaspoons sweet pickle relish","2 teaspoons minced fresh ginger","2 teaspoons lime juice","1 clove garlic, minced","1\/4 teaspoon salt"],"title":"Pacific Rim Chicken Burgers with Ginger Mayonnaise","picture_link":null},{"instructions":"Fill bread slices with VELVEETA.\nSpread outsides of sandwiches with margarine.\nCook in skillet on medium heat 3 min. on each side or until golden brown on both sides.","ingredients":["8 tsp. soft margarine","8 slices white bread","6 oz. VELVEETA Pasteurized Prepared Cheese Product, sliced"],"title":"VELVEETA Ultimate Grilled Cheese","picture_link":null}]