[{"instructions":"Heat a large Dutch oven with a tight-fitting lid over medium-high heat. Pour in enough oil to fill the pan about 1\/4-inch deep. Season the beef generously with salt and pepper, and add to the pan. Saute the meat, uncovered, stirring only occasionally, until well-browned, about 8 minutes. Using a slotted spoon, transfer the beef to a plate. Repeat with the remaining beef. Discard the oil and wipe out the pan.\nPreheat the oven to 325 degrees F. Return the pot to the stove and melt the butter over medium high heat. Add the onion and cook, stirring, until lightly browned, about 5 minutes. Add the garlic and cook, stirring, until fragrant, about 1 minute. Add the tomato paste and cook, stirring, until lightly browned, about 1 minute more. Add the reserved beef and scatter the flour over the vegetable and beef mixture (enough to lightly coat) and cook stirring until lightly toasted. Add the water or broth, and bring to a simmer. Tie the parsley, thyme, and bay leaves together with a piece of kitchen twine and add the bundle to the pot. Season with 2 teaspoons salt, or to taste. Cover and transfer to the oven. Cook the meat until just tender, about 1 1\/2 hours. (This can also be done on the stove at a low simmer.)\nRemove pot from the oven. Skim the fat from the cooking liquid with a spoon or ladle. Add the potatoes, carrots, celery, and the tomatoes, and bring to a simmer on top of the stove. Cook, uncovered, stirring occasionally, until the liquid thickens and the vegetables are tender, about 1 hour. Remove and discard the herb bundle. Stir in the vinegar and season with salt and pepper, to taste. Divide among bowls and serve immediately.\nCook's Note: Beef chuck, from the shoulder, because of its marbling of intra-muscular fat, is the choice for any type of stew. If you can't find chuck cubed for stew in your meat department, buy a thick chuck steak and cut it into 2-inch cubes.\nCopyright 2003 Television Food Network, G.P. All rights reserved","ingredients":["Vegetable oil, for searing","2 1\/2 pounds beef chuck, cut into 2-inch cubes","Kosher salt and freshly ground black pepper","2 tablespoons unsalted butter","2 medium onions, cut into 6ths","5 cloves garlic, crushed","1 tablespoon tomato paste","1\/3 cup all-purpose flour, or to cover","10 cups cold water, or chicken or beef broth, homemade or low-sodium canned","6 sprigs parsley","6 sprigs fresh thyme","2 bay leaves","1 1\/4 pounds medium red potatoes, quartered","4 medium carrots, cut into 2-inch pieces","2 celery stalks, cut into 2-inch pieces","7 canned whole, peeled tomatoes, lightly crushed","2 to 3 teaspoons red wine vinegar, or to taste"],"title":"Beef Stew","picture_link":null},{"instructions":"In a large heavy-bottomed pot, heat a 2-count of olive oil over medium heat. Add the onions, celery, carrots, and garlic and cook for about 10 minutes, stirring, until the vegetables are very tender but not browned.\nRaise the heat a bit. Take the ground veal and beef, break it up into chunks and add it to the pan. Cook, breaking up the clumps with a wooden spoon, until the meat is no longer pink. Add the wine and simmer until the wine has evaporated. Then add the tomatoes and stock and season with salt and pepper. Lower the heat and simmer very slowly for 2 to 2 1\/2 hours, stirring now and then, until the sauce is very thick. Now add the milk - the milk will make the meat nice and tender - and simmer again until thickened, another 20 to 30 minutes. Taste again for salt and pepper. Mash the sauce against the side of the pan to really blend it. Transfer half of the sauce to containers and refrigerate for up to a week, or freeze for up to several months.\nBring a big pot of lightly salted water to a boil for the spaghetti. When you're ready to serve, drop the spaghetti into the boiling water and cook until tender yet firm (\"al dente\", as they say in Italian) 7 to 8 minutes. Drain and put the spaghetti into a big pasta bowl. Return the sauce remaining in the pot to a simmer and stir in the ricotta cheese. Pour the sauce over the drained spaghetti and give it a good toss. Garnish with a handful of grated Parmigiano, the basil, and a drizzle of olive oil. Pass more grated cheese at the table.","ingredients":["Handful fresh basil leaves, torn into small pieces","Extra-virgin olive oil","2 medium onions, finely chopped","4 celery stalks, finely chopped","4 carrots, peeled and finely chopped","8 large garlic cloves, minced","2 pounds ground veal","2 pounds ground beef","2 cups dry white wine, such as Pinot Grigio","3 (28-ounce) cans whole peeled tomatoes, drained and crushed by hand","2 quarts chicken stock","Kosher salt and freshly ground black pepper","2 cups milk","1 pound dried spaghetti","Large spoonful ricotta cheese","Handful freshly grated Parmigiano-Reggiano, plus more for serving"],"title":"Spaghetti Bolognese","picture_link":null},{"instructions":"Add the olive oil to a skillet over high heat. Throw in the onions and peppers and cook until the peppers have a few dark brown\/black areas, 3 to 4 minutes. Remove and set aside. Add the Perfect Grilled Chicken to the skillet and heat over medium-high heat until warmed through. Dice into cubes and set aside.\nSizzle 1\/2 tablespoon of the butter in a separate skillet or griddle over medium heat and lay a flour tortilla in the skillet. Then build the quesadillas by laying grated cheese on the bottom tortilla, and then arranging the chicken and cooked peppers over it. Top with a little more grated cheese and top with a second tortilla.\nWhen the tortilla is golden on the first side, carefully flip the quesadilla to the other side, adding another 1\/2 tablespoon butter to the skillet at the same time. Continue cooking until the second side is golden. Repeat with the remaining tortillas and fillings.\nCut each quesadilla into wedges and serve with Pico de Gallo.\nMix together the olive oil, honey, mustard, salt, thyme, oregano and lemon juice in a large shallow container.\nPound the chicken breasts to uniform thickness and add them to the marinade. Cover and marinate in the fridge for at least 8 hours.\nHeat a grill pan over medium-high heat. Grill the chicken in batches until golden brown on the first side, 4 to 5 minutes. Flip and cook until golden brown on the other side and cooked all the way through, another 4 to 5 minutes. Let the chicken cool.\nTransfer the chicken to freezer bags individually and in pairs, so it's easy to defrost the exact amount you need. Yield: 24 servings\nSlice 2 of the jalapenos in half. With a spoon, scrape out the seeds. (If you like things spicy, leave in some of the white membranes.) Dice the jalapenos very finely; you want a hint of heat and jalapeno flavor, but you don't want to cause any fires. Now dump the jalapenos, cilantro, tomatoes and onions in a bowl.\nSlice the lime in half and squeeze the juice from half the lime into the bowl. Sprinkle with salt, and stir together until combined. Be sure to taste the pico de gallo and adjust the seasonings, adding salt or more diced jalapeno if needed.","ingredients":["1 tablespoon olive oil","1 large onion, halved and cut into slices","1 green bell pepper, seeded and sliced into strips","1 red bell pepper, seeded and sliced into strips","1 yellow bell pepper, seeded and sliced into strips","2 pounds Perfect Grilled Chicken (thawed if frozen), recipe follows","6 tablespoons butter, for frying","12 large flour tortillas","2 1\/2 cups grated cheese (Monterey Jack is the best)","Pico de Gallo, for serving, recipe follows","2 cups olive oil","6 tablespoons honey","3 heaping tablespoons Dijon mustard","1 tablespoon salt","2 teaspoons ground thyme","2 teaspoons ground oregano","Juice of 12 lemons","24 boneless, skinless chicken breasts","2 to 3 jalapenos","2 cups fresh cilantro leaves, roughly chopped","12 Roma tomatoes (slightly under ripe is fine), diced","3 yellow or red onions, diced","1 lime","Salt"],"title":"Chicken Quesadillas","picture_link":"bpo9PGjKiu.N6by1mJO2WU8QhZunkfq"},{"instructions":"First, chop the cooked turkey into 1-inch pieces, or shred by hand, and reserve. Next, in a 3 to 4 gallon stockpot over medium heat, add the butter and melt. Next, add the flour into the butter and cook together, stirring until a dark roux has been achieved (think popcorn smell).\nAdd the bacon renderings, celery, onions and bell peppers to the roux, cooking until the vegetables are softened. Next, pour a cup of the stock into the roux, mixing well to temper the roux. Then add the remaining stock and continue to cook for 30 minutes. Add the reserved turkey, the ham, file powder, garlic, salt and pepper, crushed chili peppers, thyme and bay, and cook another 30 minutes. Finally, add the okra and reduce the heat to low, cooking for 10 to 20 more minutes.\nPrepare this one day or more in advance, as the gumbo does age well.","ingredients":["1 pound cooked turkey, white and dark meat","1 1\/2 sticks butter","3\/4 cup all-purpose flour","1\/4 cup bacon renderings","3 ribs celery, chopped","2 medium onions, chopped","1 bell pepper, chopped","8 cups chicken or turkey stock","1 pound ham, diced","1 pound canned tomatoes, rough chopped","2 tablespoons file powder","1 tablespoon minced garlic","1 tablespoon mixed salt and ground pepper","1 teaspoon crushed hot red chili peppers","1 teaspoon fresh thyme leaves","1\/2 teaspoon ground bay leaves, or 3 whole leaves","2 cups diced okra"],"title":"Turkey Gumbo","picture_link":null},{"instructions":"For the smoked turkey stock: Bring the smoked turkey legs, carrot, celery, onions and 1 gallon water to a simmer in a large pot and cook for 3 hours. Strain the stock, pick the turkey meat off of the legs and reserve. You should have about 3 quarts stock.\nFor the gumbo: Melt the butter in a large pot over high heat. Whisk in the flour, reduce the heat to medium and cook, stirring constantly so the roux doesn't burn, until chocolate brown, about 15 minutes.\nAdd the onions to the roux and continue to cook, stirring frequently, until the onions are caramelized and brown, 15 to 20 minutes. Stir in the Creole spice mix, and then add the smoked chicken sausage, celery, peppers and garlic and cook for 4 to 5 minutes. Whisk in the Worcestershire sauce, thyme, bay leaves and turkey stock and bring to a simmer. Cook the gumbo, stirring occasionally, for about 60 minutes.\nAdd the okra, tomatoes, file powder, hot sauce and picked turkey meat. Season with salt and pepper and simmer for 30 minutes more.\nFor the white rice: Bring 3 cups water to a boil in a saucepan. Stir in the long-grain rice, reduce the heat to a simmer, cover and cook until all of the liquid is absorbed, 12 to 15 minutes. Fluff the rice with a fork and season with salt and pepper.\nFor serving: Divide the rice among bowls and ladle the gumbo on top.","ingredients":["2 smoked turkey legs","1 carrot, diced","1 stalk celery, diced","1 yellow onion, diced","1 cup (2 sticks) unsalted butter","1 cup all-purpose flour","2 yellow onions, diced","2 tablespoons Creole spice mix","2 pounds smoked chicken sausage, sliced","2 stalks celery, diced","2 red bell peppers, seeded and diced","2 cloves garlic, chopped","2 tablespoons Worcestershire sauce","1 teaspoon fresh thyme, chopped","2 dried bay leaves","2 cups sliced fresh okra","1 cup seeded, diced tomato","1 tablespoon file powder","1 teaspoon hot sauce, such as Tabasco","Kosher salt and freshly ground black pepper","2 cups long-grain rice","Kosher salt and freshly ground black pepper"],"title":"Chicken and Turkey Gumbo","picture_link":"AiO5HIUGOm2hXt036yywuBjTAd.ex1m"},{"instructions":"Quarter one of the onions and place in a large pot with the chicken, beer, and 2 bay leaves. Add just enough water to come up to the top of the chicken pieces. Bring to a low boil over medium-high heat, and then lower the heat and simmer until cooked through, 12 to 15 minutes. Remove the chicken from the hot liquid to a bowl and shred the meat with forks. Strain and reserve the stock.\nMeanwhile, in a small pot, cover the anchos with just enough water to cover and simmer to reconstitute, 8 to 10 minutes. Add the anchos to a food processor bowl, reserving the cooking liquid.\nToast the almonds in a saucepot large enough in which to make the sauce. Remove the toasted nuts to the food processor bowl.\nSlice the 2 remaining onions. Heat the extra-virgin olive oil over medium-high heat in the same pot you toasted the nuts in. Add the onions, garlic, last 2 bay leaves, raisins, red chile, oregano, cumin, cocoa, cinnamon, salt, and pepper. Cover and cook to soften the onions, 10 minutes, stirring occasionally. Add the crushed tomatoes and heat through. Transfer to the food processor with the reconstituted anchos and almonds. Process into a thick paste and return to the saucepot. Add a little of the chicken stock and ancho stock to thin the sauce a bit. It should remain thick enough to coat the back of a spoon. Add the shredded chicken to the sauce then serve with warm corn or flour tortillas for wrapping. Garnish with pepitas.","ingredients":["3 medium onions","8 boneless chicken thighs","1 Mexican-style beer (recommended: Negra Modela)","4 fresh bay leaves","3 ancho chilies, seeded and stemmed","1\/4 cup sliced almonds","2 tablespoons extra-virgin olive oil","4 cloves garlic, thinly sliced","2 tablespoons golden raisins","1 red chile pepper, such as Fresno or Holland","2 small stems fresh oregano or marjoram, finely chopped","1 tablespoon cumin","2 tablespoons unsweetened Mexican cocoa powder","Pinch cinnamon","Kosher salt and freshly ground black pepper","1 (15-ounce) can fire-roasted crushed tomatoes","Small corn or flour tortillas, warmed to package directions, for serving","Toasted pepitas, for garnish"],"title":"Beer-Poached Pulled Chicken Mole","picture_link":"fgTRwjDTleg3KKoTJMrI8NSulc9RxQG"},{"instructions":"For the marinade: Place the garlic, shallots, onions, parsley, and vegetable oil in a food processor, and puree. Transfer the garlic mixture to a container, and set aside. For the chicken: Put the chicken pieces in a bowl and add half of the Amise marinade, cover, and marinate in the refrigerator for a maximum of 24 hours. In a wide-based pan, heat the sugar and vegetable oil over medium-high heat. Swirl the glaze until the sugar caramelizes and browns, approximately 7 to 10 minutes. As soon as the sugar caramelizes, add the chicken pieces, in one layer skin-side down and brown the chicken on all sides, about approximately 5 minutes. Add the onion, chile, plantain, tomatoes, and Worcestershire sauce to the pan, and stir. Pour in the chicken stock, and bring the ingredients to a boil. Add in the reserved marinade and reduce the heat to medium. Cook for 30 to 40 minutes, and season the dish with salt, to taste. Turn off the heat. Transfer the chicken to a serving plate and garnish with the cilantro leaves just before serving.","ingredients":["6 cloves garlic, chopped","2 shallots, coarsely chopped","Bunch green onions, trimmed and chopped","Bunch fresh flat-leaf parsley, leaves and stems coarsely chopped","1\/2 cup vegetable oil","1 (3-pound) whole chicken, cut into pieces","1 cup sugar","1\/4 cup vegetable oil","1\/2 white onion, cut into small dice","1 green chile, seeded and halved lengthwise, optional","1 unripe plantain, halved lengthwise and chopped","4 plum tomatoes, chopped","1\/4 cup Worcestershire sauce","1\/2 cup chicken stock","Kosher salt","1 cup fresh cilantro leaves"],"title":"Trinidadian-Style Chicken","picture_link":null},{"instructions":"In a saucepan, bring the stock to a simmer over medium-low heat.\nIn a large saucepan, cook the onion in oil over medium-low heat, stirring, until softened, for about 5 minutes. Add rice, stirring until each grain is coated with oil. Add about 3\/4 cup simmering stock and cook over medium-high heat, stirring constantly, until the stock is absorbed. Continue adding stock, 3\/4 cup at a time, still stirring constantly and letting each batch be absorbed before adding the next, until about 1\/2 of the stock is remaining. Reduce the heat to moderate, if necessary to keep the risotto at a simmer. Continue adding the stock in the same manner until the rice is tender and creamy looking but still al dente, about 20 minutes.\nReduce the heat to low, add the butter then the cheeses. Mix well. Add the spinach and the lemon juice and continue mixing. Remove from the heat and keep warm.\nIn a heavy-bottomed frying pan, heat the canola oil and saute the shrimp for 2 to 3 minutes. Take the pan off the heat and immediately add the ouzo and light it. Let the flame subside. Season the shrimp with salt, and pepper, and set aside.\nGarnish each portion of the risotto with grilled shrimp, parsley, lemon zest, and feta cheese.\nTo make veal stock:\nPreheat the oven to 450 degrees F.\nRemove meat from bones where possible and cut into 1-inch pieces. If using breast bones, cut apart. In roasting pan, arrange bones and meat in 1 layer, drizzle with oil, season with salt, and pepper and roast in lower part of the oven, stirring half way in between until bones are golden brown, 40 minutes to 1 hour depending on the size of the bones. Add the tomato paste by spooning it over the bones. Add the vegetables and put it in the oven for an additional hour.\nInto a large stockpot, add bones, meat, roasted vegetables, herbs, and 16 cups (4 L) water. Discard fat from roasting pan. Place tray back onto the stovetop. Heat on medium for about 1 minute then remove. Immediately add 1\/2 cup to 1 cup water to the pan, scraping up brown bits, put the tray back on heat and then add the deglazed liquid to the stockpot. Bring liquid to a tremble, about 190 degrees F, and cook at 190 degrees F (skim froth frequently during first hour of cooking) for 8 hours.\nPour stock in batches through a large fine sieve and discard solids. Skim off fat. (Alternatively, cool stock, uncovered, and chill, covered. Scrape congealed fat from chilled stock.) Gently simmer stock, skimming froth occasionally, until reduced to about 4 cups (1 L), about 1 hour. Cool stock, uncovered, and chill, covered. Stock keeps, covered and chilled, 1 week or, frozen in airtight containers, 3 months. If desired, pour cooled stock into ice-cube trays with 1-ounce cups and freeze. Frozen cubes keep in heavy-duty sealable plastic bags 3 months.","ingredients":["4 cups Chuck's veal stock, recipe follows or low-sodium chicken stock","1 onion, finely chopped","1 tablespoon olive oil","2 cups Arborio rice","1\/4 cup butter","1 cup grated Kefalotyri cheese","1 cup cubed feta cheese, plus more for garnish","4 cups spinach","Zest and juice of 1 lemon","1 tablespoon canola oil","12 large shrimp, cleaned and de-veined, tail intact","2 tablespoons ouzo","2 tablespoons butter","Sea salt and freshly ground black pepper","1\/4 cup finely chopped fresh parsley","8 meaty veal bones","3 tablespoons (45 ml) canola oil","Sea salt and freshly ground black pepper","1 tablespoon (15 ml) tomato paste","1 head garlic","6 carrots","2 onions","4 stalks celery","2 large leeks","4 sprigs fresh thyme","4 sprigs fresh rosemary","4 large sprigs fresh flat-leaf parsley","17 cups water"],"title":"Spinach and Lemon Risotto","picture_link":null},{"instructions":"Preheat the oven to 400 degrees F.\nSaute onion in hot oil in a 10-inch cast-iron skillet over medium-high heat 3 to 4 minutes or until tender. Stir in beans and next 8 ingredients. Bring to a boil; reduce heat and simmer, uncovered, 15 minutes.\nCombine baking mix, egg, and milk in a medium bowl, stirring until smooth. Fold in 1\/2 cup cheese and 1\/4 cup cilantro; pour over simmering chicken mixture.\nBake for 20 minutes or until a wooden pick inserted in topping comes out clean. Sprinkle with remaining 1\/2 cup cheese and remaining 1\/4 cup cilantro. Sprinkle avocado slices with lime juice, and arrange over cobbler. Serve with sour cream.","ingredients":["1 medium onion, sliced","2 tablespoons vegetable oil","One 15-ounce can black beans, rinsed and drained","One 10-ounce can diced tomatoes and onions with lime juice and cilantro","One 10-ounce can enchilada sauce","2 cups cubed cooked chicken","1 teaspoon salt","1\/2 teaspoon ground cumin","1\/2 teaspoon chili powder","1\/2 teaspoon dried oregano","1\/2 teaspoon ground pepper","1 1\/2 cups all-purpose baking mix","1 large egg","2\/3 cup milk","1 cup (4 ounces) shredded extra-sharp Cheddar, divided","1\/2 cup chopped fresh cilantro leaves, divided","2 avocados, sliced","1 tablespoon lime juice","Sour cream"],"title":"Spicy Tex-Mex Chicken Cobbler","picture_link":null}]